<a href="https://colab.research.google.com/github/mayank250687/ML_inueron/blob/master/Pandas_assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [72]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

**Fill in these missing numbers and make the column an integer column**

In [73]:
for i in range(len(df)):
  if pd.isnull(df.loc[i,'FlightNumber']):
    df.loc[i,'FlightNumber']=(df.loc[(i-1),'FlightNumber'])+10
    
df['FlightNumber']=df['FlightNumber'].astype(int)
    
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

**The From_To column would be better as two separate columns**

In [74]:
df_temp=pd.DataFrame()
From=[]
To=[]

for i in df['From_To']:
  l=[]
  l=i.split('_')
  From.append(l[0])
  To.append(l[1])

df_temp['From']=From
df_temp['To']=To

df_temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

**Standardise the strings so that only the first letter is uppercase**

In [75]:
df_temp['From']=df_temp['From'].str.capitalize()
df_temp['To']=df_temp['To'].str.capitalize()

df_temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

**Delete the From_To column from df and attach the temporary DataFrame from the previous questions.**

In [76]:
df=df.join(df_temp)
df.drop('From_To',axis=1,inplace=True)

**Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2**

In [77]:
delays = df['RecentDelays'].apply(pd.Series)

col=[]
for i in range(1,len(delays.columns)+1):
  col.append('Delay_{}'.format(i))

delays.columns=col

df=df.join(delays,)

df.drop('RecentDelays',axis=1,inplace=True)

df

   FlightNumber              Airline      From  ... Delay_1  Delay_2  Delay_3
0         10045               KLM(!)    London  ...    23.0     47.0      NaN
1         10055    <Air France> (12)    Madrid  ...     NaN      NaN      NaN
2         10065  (British Airways. )    London  ...    24.0     43.0     87.0
3         10075       12. Air France  Budapest  ...    13.0      NaN      NaN
4         10085          "Swiss Air"  Brussels  ...    67.0     32.0      NaN

[5 rows x 7 columns]